In [2]:
import pandas as pd

C:\Users\USER\AppData\Local\Temp\ipykernel_11032\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
data = {
    "Day":["1/1/2024","1/2/2024","1/3/2024","1/4,/2024","1/5/2024","1/6/2024"],
    "Temperature":[32,35,28,24,32,32],
    "Windspeed":[6,7,2,7,4,2],
    "Event":["Rain","Sunny","Snow","Snow","Rain","Sunny"]
}
weather = pd.DataFrame(data)
weather

         Day  Temperature  Windspeed  Event
0   1/1/2024           32          6   Rain
1   1/2/2024           35          7  Sunny
2   1/3/2024           28          2   Snow
3  1/4,/2024           24          7   Snow
4   1/5/2024           32          4   Rain
5   1/6/2024           32          2  Sunny

In [5]:
weather = pd.DataFrame(data,index=[1,2,3,4,5,6])
weather

         Day  Temperature  Windspeed  Event
1   1/1/2024           32          6   Rain
2   1/2/2024           35          7  Sunny
3   1/3/2024           28          2   Snow
4  1/4,/2024           24          7   Snow
5   1/5/2024           32          4   Rain
6   1/6/2024           32          2  Sunny

In [6]:
weather.columns

Index(['Day', 'Temperature', 'Windspeed', 'Event'], dtype='object')

In [7]:
weather.describe()

       Temperature  Windspeed
count     6.000000   6.000000
mean     30.500000   4.666667
std       3.885872   2.338090
min      24.000000   2.000000
25%      29.000000   2.500000
50%      32.000000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [8]:
import os 
os.getcwd()

'c:\\Users\\USER\\Documents\\Introduction-to-python'

In [33]:
os.listdir()

['.git',
 'dataset',
 'Friends.csv',
 'gathungu pandas.ipynb',
 'gathungunov.ipynb',
 'gathungu_test.ipynb',
 'Introduction to pandas.ipynb',
 'Introduction.ipynb',
 'README.md']

In [34]:
Friends=pd.read_csv('Friends.csv')
Friends

     Name  Weigth  Heigth Location Education
0  Mwangi      50       5  Nairobi   Diploma
1     Ali      85       6   Kiambu    Degree
2   James      59       5   Kisumu   Masters
3   Linda      63       6    Nyeri    Degree
4    Jane      95       5   Kiambu    Degree
5  Wangui      84       6   Kiambu       PHD
6   Kamau      51       6  Nairobi   Diploma
7  Torres      81       5    Thika   Diploma
8    Tony      64       6      Voi    Degree
9    Cate      98       5     Lamu   Masters

In [38]:
os.listdir("../../Desktop/")

['@',
 'Adidas-Dashboard-START.xlsx',
 'Book2.xlsx',
 'BSC.doc',
 'desktop.ini',
 'GateWay to Arabic Book 1.pdf',
 'Karoki.pdf',
 'Lesson_Plan Gathungu.docx',
 'Photos',
 'Presentation Gathungu.pptx',
 'Python',
 'Python Programming Book.pdf',
 'receipt.pdf',
 'Research',
 'Visual Studio Code.lnk',
 '~$Adidas-Dashboard-START.xlsx',
 '~$BSC.doc',
 '~$P.F.A.doc',
 '~$sson_Plan Gathungu.docx']

In [39]:
df=pd.read_excel("../../Desktop/Adidas-Dashboard-START.xlsx",sheet_name="Data",skiprows=4)
df.shape

(9648, 14)

In [1]:
import pandas as pd

C:\Users\USER\AppData\Local\Temp\ipykernel_2788\2035458946.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [134]:
print(pd.__version__)

2.2.0

In [135]:
s1=pd.Series()
s1

Series([], dtype: object)

In [136]:
s2=pd.Series([1,2,3,4,5])
s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [232]:
order=[1,2,3,4,5]
s22=pd.Series([1,2,3,4,5],index=order)
s22

1    1
2    2
3    3
4    4
5    5
dtype: int64

In [233]:
s3 = pd.Series([1,2,3,4,5],index=[10,20,30,40,50])
s3

10    1
20    2
30    3
40    4
50    5
dtype: int64

In [280]:
a=[1,2,3,4,5]
s33=pd.Series(a)
s33

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [328]:
s33.index=["A","B","C","D","E"]
s33

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [ ]:
scores = pd.Series([3.2,4.5,2.6,5.0,3.8],index=["Bob","George","Alex","Fiona","Sarah"])
scores

Bob       3.2
George    4.5
Alex      2.6
Fiona     5.0
Sarah     3.8
dtype: float64

In [ ]:
scores.index

Index(['Bob', 'George', 'Alex', 'Fiona', 'Sarah'], dtype='object')

In [ ]:
scores.values

array([3.2, 4.5, 2.6, 5. , 3.8])

In [ ]:
#dictionary

In [ ]:
d={"Bob":3.2,"George":4.5,"Alex":2.6,"Fiona":5.0,"Sarah":3.8}
s4=pd.Series(d)
s4

Bob       3.2
George    4.5
Alex      2.6
Fiona     5.0
Sarah     3.8
dtype: float64

In [ ]:
Dataset={
    "Name":["Bob","George","Alex","Fiona","Sarah"],
    "Marks":[3.2,4.5,2.6,5.0,3.8]
}
Scores=pd.DataFrame(Dataset)
Scores

     Name  Marks
0     Bob    3.2
1  George    4.5
2    Alex    2.6
3   Fiona    5.0
4   Sarah    3.8

In [ ]:
Scores=pd.DataFrame(Dataset,index=[1,2,3,4,5])
Scores

     Name  Marks
1     Bob    3.2
2  George    4.5
3    Alex    2.6
4   Fiona    5.0
5   Sarah    3.8

In [ ]:
#Nested list
students_list = [["Bob","William",26,"Computer Engineering",86],
                 ["Emma","Johnson",23,"Math,92"],
                 ["Sarah","Smith",22,"Chemistry",95],
                 ["Alex","Brown",21,"Electrical Engineering",82]]
students_df=pd.DataFrame(students_list)
students_df

       0        1   2                       3     4
0    Bob  William  26    Computer Engineering  86.0
1   Emma  Johnson  23                 Math,92   NaN
2  Sarah    Smith  22               Chemistry  95.0
3   Alex    Brown  21  Electrical Engineering  82.0

In [ ]:
students_df=pd.DataFrame(students_list,columns=["First_Name","Last_Name","Age","Major","Score"])
students_df

  First_Name Last_Name  Age                   Major  Score
0        Bob   William   26    Computer Engineering   86.0
1       Emma   Johnson   23                 Math,92    NaN
2      Sarah     Smith   22               Chemistry   95.0
3       Alex     Brown   21  Electrical Engineering   82.0

In [ ]:
students_df=pd.DataFrame(students_list,columns=["First_Name","Last_Name","Age","Major","Score"],index=[1,2,3,4])
students_df

  First_Name Last_Name  Age                   Major  Score
1        Bob   William   26    Computer Engineering   86.0
2       Emma   Johnson   23                 Math,92    NaN
3      Sarah     Smith   22               Chemistry   95.0
4       Alex     Brown   21  Electrical Engineering   82.0

In [ ]:
students_df.describe()

             Age      Score
count   4.000000   3.000000
mean   23.000000  87.666667
std     2.160247   6.658328
min    21.000000  82.000000
25%    21.750000  84.000000
50%    22.500000  86.000000
75%    23.750000  90.500000
max    26.000000  95.000000

In [ ]:
students_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First_Name  4 non-null      object
 1   Last_Name   4 non-null      object
 2   Age         4 non-null      int64
 3   Major       4 non-null      object
 4   Score       3 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 192.0+ bytes

In [ ]:
students_df.head(2)

  First_Name Last_Name  Age                 Major  Score
1        Bob   William   26  Computer Engineering   86.0
2       Emma   Johnson   23               Math,92    NaN

In [ ]:
students_df.tail(2)

  First_Name Last_Name  Age                   Major  Score
3      Sarah     Smith   22               Chemistry   95.0
4       Alex     Brown   21  Electrical Engineering   82.0

In [ ]:
df=pd.read_csv("Friends.csv")
df

     Name  Weigth  Heigth Location Education
0  Mwangi      50       5  Nairobi   Diploma
1     Ali      85       6   Kiambu    Degree
2   James      59       5   Kisumu   Masters
3   Linda      63       6    Nyeri    Degree
4    Jane      95       5   Kiambu    Degree
5  Wangui      84       6   Kiambu       PHD
6   Kamau      51       6  Nairobi   Diploma
7  Torres      81       5    Thika   Diploma
8    Tony      64       6      Voi    Degree
9    Cate      98       5     Lamu   Masters

In [ ]:
#no header
#df1=pd.read_csv("Friends1.csv",skiprows=1,names=["Name","Weigth","heigth","Location","Education"])
#df1=pd.read_csv("Friends1.csv",header=None,names=["Name","Weigth","heigth","Location","Education"])

In [ ]:
df1=pd.read_csv("Friends1.csv",header=None,names=["Name","Weigth","heigth","Location","Education"])
df1

     Name  Weigth  heigth Location Education
0  Mwangi      50       5  Nairobi   Diploma
1     Ali      85       6   Kiambu    Degree
2   James      59       5   Kisumu   Masters
3   Linda      63       6    Nyeri    Degree
4    Jane      95       5   Kiambu    Degree
5  Wangui      84       6   Kiambu       PHD
6   Kamau      51       6  Nairobi   Diploma
7  Torres      81       5    Thika   Diploma
8    Tony      64       6      Voi    Degree
9    Cate      98       5     Lamu   Masters

In [ ]:
#using separator
#df3=pd.read_csv("Friends3.csv",sep="/")

In [ ]:
df3=pd.read_csv("Friends3.csv",sep="/")
df3

     Name  Weigth  Heigth Location Education
0  Mwangi      50       5  Nairobi   Diploma
1     Ali      85       6   Kiambu    Degree
2   James      59       5   Kisumu   Masters
3   Linda      63       6    Nyeri    Degree
4    Jane      95       5   Kiambu    Degree
5  Wangui      84       6   Kiambu       PHD
6   Kamau      51       6  Nairobi   Diploma
7  Torres      81       5    Thika   Diploma
8    Tony      64       6      Voi    Degree
9    Cate      98       5     Lamu   Masters

In [ ]:
# when there are comments
#df4=pd.read_csv("Friends4.csv",comment="#")

In [ ]:
df4=pd.read_csv("Friends4.csv",comment="#")
df4

     Name  Weigth  Heigth Location Education
0  Mwangi      50       5  Nairobi   Diploma
1     Ali      85       6   Kiambu    Degree
2   James      59       5   Kisumu   Masters
3   Linda      63       6    Nyeri    Degree
4    Jane      95       5   Kiambu    Degree
5  Wangui      84       6   Kiambu       PHD
6   Kamau      51       6  Nairobi   Diploma
7  Torres      81       5    Thika   Diploma
8    Tony      64       6      Voi    Degree
9    Cate      98       5     Lamu   Masters

In [ ]:
dft=pd.read_csv("titanic.csv")
dft

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
dft.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
ages=dft["Age"]
ages

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [ ]:
type(ages)

pandas.core.series.Series

In [ ]:
ages.mean()

29.69911764705882

In [ ]:
ages.max()

80.0

In [ ]:
dft[["Name","Age"]]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [ ]:
dft.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [ ]:
dft.iloc[0,[1,4]]

Survived       0
Sex         male
Name: 0, dtype: object

In [ ]:
dft.loc[0,["Survived","Sex"]]

Survived       0
Sex         male
Name: 0, dtype: object

In [ ]:
dft.iloc[:5,:3]

   PassengerId  Survived  Pclass
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

In [ ]:
dft.iloc[[0,-1],-3:]

     Fare Cabin Embarked
0    7.25   NaN        S
890  7.75   NaN        Q

In [ ]:
dft.loc[5:10,"Name":"Ticket"]

,Name,Sex,Age,SibSp,Parch,Ticket
5,"Moran, Mr. James",male,NaN,0,0,330877
6,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463
7,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909
8,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742
9,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736
10,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549

In [ ]:
#conditional selection
dft.Sex=="male"

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Sex, Length: 891, dtype: bool

In [ ]:
dft.loc[dft.Sex=="male"]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
dft.Sex=="female"

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888     True
889    False
890    False
Name: Sex, Length: 891, dtype: bool

In [ ]:
dft.Age>35

0      False
1       True
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [ ]:
dft.loc[(dft.Sex=="female")&(dft.Age>35)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q

In [ ]:
dft.Age>35

0      False
1       True
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [ ]:
dft.Sex=="male"

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Sex, Length: 891, dtype: bool

In [ ]:
dft.loc[(dft.Sex=="male")&(dft.Age<35)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.075,NaN,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.050,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.125,NaN,Q
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.000,D56,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.500,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

In [ ]:
dft=pd.read_csv("titanic.csv")
dft

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
dft.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [ ]:
dft.isna().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [ ]:
print(pd.__version__)

2.2.0

In [ ]:
dates=pd.date_range("today",periods=6)
dates

DatetimeIndex(['2024-02-14 08:34:46.903254', '2024-02-15 08:34:46.903254',
               '2024-02-16 08:34:46.903254', '2024-02-17 08:34:46.903254',
               '2024-02-18 08:34:46.903254', '2024-02-19 08:34:46.903254'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
dates=pd.date_range("today",periods=6)
dates

In [ ]:
import pandas as pd

In [ ]:
print(pd.__version__)